experiments/2026-08-18-qwen-qwen3-8b-v1-5fa1f7e/vllm__ragged.log
INFO 08-18 17:06:06 [importing.py:53] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 08-18 17:06:06 [importing.py:88] Triton not installed or not compatible; certain GPU-related functions will not be available.
INFO 08-18 17:06:08 [main.py:71] Unspecified platform detected, switching to CPU Platform instead.
WARNING 08-18 17:06:08 [cpu.py:440] Failed to import from vllm._C: ModuleNotFoundError("No module named 'vllm._C'")
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7566a5130fe0>, trust_remote_code=False, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=512, random_range_ratio='0.75', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://vllm:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/results', result_filename='vllm__ragged.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-0659b71d-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-18 17:06:11 [utils.py:90] Sampling input_len from [128, 896] and output_len from [128, 896]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Benchmark duration (s):                  86.61     
Total input tokens:                      51917     
Total generated tokens:                  55471     
Request throughput (req/s):              1.15      
Output token throughput (tok/s):         640.44    
Peak output token throughput (tok/s):    720.00    
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          1239.85   
---------------Time to First Token----------------
Mean TTFT (ms):                          37366.65  
Median TTFT (ms):                        36527.63  
P99 TTFT (ms):                           78302.22  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          11.77     
Median TPOT (ms):                        11.80     
P99 TPOT (ms):                           12.07     
---------------Inter-token Latency----------------
Mean ITL (ms):                           11.79     
Median ITL (ms):                         11.45     
P99 ITL (ms):                            27.87     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          43896.95  
Median E2EL (ms):                        44013.98  
P99 E2EL (ms):                           84001.26  
==================================================

--- stderr ---
W0818 17:06:07.066000 1 torch/utils/cpp_extension.py:178] No CUDA runtime is found, using CUDA_HOME='/usr/local/cuda'
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:02<03:40,  2.22s/it]
  2%|▏         | 2/100 [00:02<01:40,  1.02s/it]
  3%|▎         | 3/100 [00:03<01:57,  1.21s/it]
  4%|▍         | 4/100 [00:04<01:36,  1.01s/it]
  5%|▌         | 5/100 [00:05<01:26,  1.10it/s]
  6%|▌         | 6/100 [00:08<02:48,  1.79s/it]
  8%|▊         | 8/100 [00:09<01:32,  1.00s/it]
  9%|▉         | 9/100 [00:09<01:20,  1.13it/s]
 10%|█         | 10/100 [00:09<01:03,  1.42it/s]
 11%|█         | 11/100 [00:10<01:11,  1.25it/s]
 12%|█▏        | 12/100 [00:11<01:12,  1.21it/s]
 13%|█▎        | 13/100 [00:11<00:53,  1.61it/s]
 14%|█▍        | 14/100 [00:13<01:10,  1.21it/s]
 15%|█▌        | 15/100 [00:14<01:14,  1.14it/s]
 16%|█▌        | 16/100 [00:15<01:16,  1.10it/s]
 17%|█▋        | 17/100 [00:16<01:26,  1.05s/it]
 18%|█▊        | 18/100 [00:16<01:06,  1.24it/s]
 19%|█▉        | 19/100 [00:17<01:06,  1.22it/s]
 20%|██        | 20/100 [00:18<00:54,  1.47it/s]
 21%|██        | 21/100 [00:18<00:43,  1.82it/s]
 22%|██▏       | 22/100 [00:21<01:34,  1.21s/it]
 23%|██▎       | 23/100 [00:22<01:35,  1.24s/it]
 25%|██▌       | 25/100 [00:23<01:07,  1.11it/s]
 26%|██▌       | 26/100 [00:24<01:08,  1.08it/s]
 27%|██▋       | 27/100 [00:24<00:57,  1.27it/s]
 28%|██▊       | 28/100 [00:25<01:00,  1.19it/s]
 29%|██▉       | 29/100 [00:25<00:45,  1.57it/s]
 30%|███       | 30/100 [00:26<00:41,  1.71it/s]
 31%|███       | 31/100 [00:27<00:46,  1.47it/s]
 32%|███▏      | 32/100 [00:27<00:35,  1.90it/s]
 33%|███▎      | 33/100 [00:30<01:28,  1.32s/it]
 34%|███▍      | 34/100 [00:31<01:20,  1.23s/it]
 35%|███▌      | 35/100 [00:31<00:58,  1.11it/s]
 36%|███▌      | 36/100 [00:31<00:43,  1.49it/s]
 37%|███▋      | 37/100 [00:33<00:54,  1.17it/s]
 38%|███▊      | 38/100 [00:33<00:42,  1.46it/s]
 39%|███▉      | 39/100 [00:34<00:38,  1.58it/s]
 40%|████      | 40/100 [00:34<00:33,  1.81it/s]
 41%|████      | 41/100 [00:36<00:52,  1.13it/s]
 42%|████▏     | 42/100 [00:36<00:41,  1.40it/s]
 43%|████▎     | 43/100 [00:36<00:32,  1.73it/s]
 44%|████▍     | 44/100 [00:37<00:32,  1.71it/s]
 45%|████▌     | 45/100 [00:40<01:13,  1.33s/it]
 46%|████▌     | 46/100 [00:41<01:14,  1.37s/it]
 47%|████▋     | 47/100 [00:42<01:03,  1.20s/it]
 48%|████▊     | 48/100 [00:43<00:54,  1.05s/it]
 49%|████▉     | 49/100 [00:43<00:43,  1.18it/s]
 50%|█████     | 50/100 [00:43<00:31,  1.59it/s]
 51%|█████     | 51/100 [00:44<00:29,  1.67it/s]
 52%|█████▏    | 52/100 [00:45<00:39,  1.22it/s]
 53%|█████▎    | 53/100 [00:45<00:30,  1.56it/s]
 54%|█████▍    | 54/100 [00:46<00:30,  1.51it/s]
 55%|█████▌    | 55/100 [00:47<00:31,  1.44it/s]
 56%|█████▌    | 56/100 [00:47<00:25,  1.74it/s]
 57%|█████▋    | 57/100 [00:47<00:21,  2.02it/s]
 58%|█████▊    | 58/100 [00:48<00:18,  2.30it/s]
 59%|█████▉    | 59/100 [00:49<00:22,  1.79it/s]
 60%|██████    | 60/100 [00:50<00:34,  1.16it/s]
 61%|██████    | 61/100 [00:51<00:29,  1.31it/s]
 62%|██████▏   | 62/100 [00:53<00:43,  1.15s/it]
 63%|██████▎   | 63/100 [00:53<00:34,  1.08it/s]
 64%|██████▍   | 64/100 [00:54<00:27,  1.29it/s]
 65%|██████▌   | 65/100 [00:54<00:23,  1.48it/s]
 66%|██████▌   | 66/100 [00:55<00:27,  1.24it/s]
 67%|██████▋   | 67/100 [00:56<00:22,  1.46it/s]
 68%|██████▊   | 68/100 [00:58<00:37,  1.16s/it]
 69%|██████▉   | 69/100 [00:59<00:40,  1.31s/it]
 70%|███████   | 70/100 [01:01<00:38,  1.28s/it]
 71%|███████   | 71/100 [01:01<00:30,  1.06s/it]
 72%|███████▏  | 72/100 [01:02<00:24,  1.17it/s]
 73%|███████▎  | 73/100 [01:02<00:20,  1.34it/s]
 74%|███████▍  | 74/100 [01:04<00:25,  1.04it/s]
 76%|███████▌  | 76/100 [01:05<00:20,  1.17it/s]
 77%|███████▋  | 77/100 [01:06<00:17,  1.29it/s]
 78%|███████▊  | 78/100 [01:06<00:14,  1.49it/s]
 79%|███████▉  | 79/100 [01:07<00:18,  1.14it/s]
 80%|████████  | 80/100 [01:09<00:20,  1.02s/it]
 81%|████████  | 81/100 [01:09<00:15,  1.20it/s]
 82%|████████▏ | 82/100 [01:10<00:14,  1.25it/s]
 83%|████████▎ | 83/100 [01:11<00:13,  1.23it/s]
 84%|████████▍ | 84/100 [01:11<00:12,  1.24it/s]
 85%|████████▌ | 85/100 [01:12<00:11,  1.27it/s]
 86%|████████▌ | 86/100 [01:13<00:09,  1.46it/s]
 87%|████████▋ | 87/100 [01:14<00:09,  1.34it/s]
 88%|████████▊ | 88/100 [01:14<00:07,  1.55it/s]
 89%|████████▉ | 89/100 [01:14<00:05,  1.88it/s]
 90%|█████████ | 90/100 [01:15<00:07,  1.32it/s]
 91%|█████████ | 91/100 [01:18<00:10,  1.20s/it]
 92%|█████████▏| 92/100 [01:19<00:09,  1.19s/it]
 93%|█████████▎| 93/100 [01:19<00:06,  1.03it/s]
 94%|█████████▍| 94/100 [01:20<00:05,  1.07it/s]
 95%|█████████▌| 95/100 [01:21<00:03,  1.34it/s]
 96%|█████████▌| 96/100 [01:22<00:03,  1.15it/s]
 97%|█████████▋| 97/100 [01:22<00:02,  1.43it/s]
 98%|█████████▊| 98/100 [01:23<00:01,  1.33it/s]
 99%|█████████▉| 99/100 [01:23<00:00,  1.39it/s]
100%|██████████| 100/100 [01:26<00:00,  1.29s/it]
100%|██████████| 100/100 [01:26<00:00,  1.15it/s]